{
  "id": "68796c78a4ac7ef2a17a6174",
  "lessonNumber": 2,
  "title": "Lesson 2 — Data Structures and File Handling",
  "status": "pending",
  "assignment": {
    "title": "Assignment for Lesson 2",
    "objective": "No objective specified",
    "expectedCapabilities": [],
    "instructions": [],
    "tasks": [
      {
        "taskNumber": 1,
        "title": "Task 1",
        "description": "## Lesson 2 Assignment: Data Structures and File Handling\n\n**Objective:** In this assignment, you practice the use of the input() function.  You also practice file operations.  You use several methods of the list class, and you construct dictionaries from the contents of a CSV file.\n\n### **Step 1: Complete the Coding Tasks**  \n\nHomework for this assignment is created within your `python_homework` folder.  Be sure to create an `assignment2` branch.  Then, write Python code to complete the following tasks.  As you do, remember to put in **comment lines to mark your code for Task 1, Task 2, and so on.**\n\n**Help is Available**\n\nYou may find these tasks a little challenging.  If you get stuck, 1:1 mentors are available to answer your questions.  Appointments are available in the [1:1 Mentor Table](https://airtable.com/appoSRJMlXH9KvE6w/shrQinGb1phZYwdiL)\n\nOn Windows, if you find that the prompt in git bash is unexpected, you can fix it by running ``cd \\`pwd``.\n\nSince Python uses indentation to define blocks of code, it is often necessary to indent or outdent a whole block of code.  You can do this in vscode by selecting the code and then typing `ctl-]` to indent or `ctl-[` to outdent.\n\n\n---\n\n### **Task 1: Diary**\n\n1. Change to the `assignment2` folder of your `python_homework` folder.  You create your programs for the assignment in this folder.\n\n2. Create a program called `diary.py`. Add code to do the following:\n   - Open a file called `diary.txt` for appending.\n   - In a loop, prompt the user for a line of input.  The first prompt should say, \"What happened today? \".  All subsequent prompts should say \"What else? \"\n   - As each line is received, write it to `diary.txt`, with a newline (`\\n`) at the end.\n   - When the special line \"done for now\" is received, write that to `diary.txt`.  Then close the file and exit the program (you just exit the loop).\n   - Wrap all of this in a try block. If an exception occurs, catch the exception and print out \"An exception occurred.\" followed by the name of the exception itself. Now, normally, you catch specific types of exceptions, and handle each according to program logic.  In this case, you can catch any non-fatal exceptions via an except for `Exception`, and then display the information from the exception and exit the program.  The `traceback` module provides a way to include function traceback information in your error message, which will make it easier to find the error.  You can use the following code to handle exceptions using the traceback module.\n   ```python\n   import traceback\n\n   ...\n\n   except Exception as e:\n      trace_back = traceback.extract_tb(e.__traceback__)\n      stack_trace = list()\n      for trace in trace_back:\n         stack_trace.append(f'File : {trace[0]} , Line : {trace[1]}, Func.Name : {trace[2]}, Message : {trace[3]}')\n      print(f\"Exception type: {type(e).__name__}\")\n      message = str(e)\n      if message:\n         print(f\"Exception message: {message}\")\n      print(f\"Stack trace: {stack_trace}\")\n   ```\n   - Open the file using a `with` statement (inside the try block), and rely on that statement to handle the file close.\n   - The input statement should be inside the loop inside the `with` block.\n\n3. Test the program.\n   - Run it a couple of times to create diary entries. (`python diary.py`)\n   - Have a look at `diary.txt` to make sure it appears correct.  **Warning:** `diary.txt` will end up in GitHub when you submit your homework, so don't put in anything personal.\n   - Trigger an exception while running the program:  When it prompts you for input, press Ctrl-D.  You may need to type Ctrl-C and newline to trigger an exception if Ctrl-D doesn't work.  Check to see that the exception is handled. \n\n### **Task 2: Read a CSV File**\n\nThis task, and the others that follow below, use the same pattern as for assignment1. This pattern is known as Test Driven Development (TDD).  It is a good practice which is often used in software industry.  You will need to create assignment2.py for the rest of the tasks.  Then type the following command:\n```bash\npytest -v -x assignment2-test.py\n```\nThis will give errors to report what you need to fix.  You run it repeatedly as you create the following functions, until all functions are working correctly.\n\nRemember to import the `csv` module for this task.\n\n2. Create a function called read_employees that has no arguments, and do the following within it. \n   - Declare an empty dict.  You'll add the key/value pairs to that.  Declare also an empty list to store the rows.\n   - You next read a csv file. Use a try block and a with statement, so that your code is robust and so that the file gets closed.\n   - Read `../csv/employees.csv` using csv.reader().  (This csv file is used in a later lesson to populate a database.)\n   - As you loop through the rows, store the first row in the dict using the key \"fields\".  These are the column headers.\n   - Add all the other rows (not the first) to your rows list.\n   - Add the list of rows (this is a list of lists) to the dict, using the key \"rows\".\n   - The function should return the dict.\n   - Add a line below the function that calls read_employees and stores the returned value in a global variable called employees. Then print out this value, to verify that the function works.\n   - In this case, it's not clear what to do if you get an exception.  You might get an exception because the filename is bad, or because the file couldn't be parsed as a CSV file.  For now, just use the same approach as described above: catch the exception, print out the information, and exit the program.  One likely exception in this case is an error in the syntax of your code.\n\n3. Run the test to see if you have this much right.\n\nA word about what's going on when the test runs: The test file imports your assignment2.py module.  When the import statement occurs, all the program statements in your module that are outside of functions do run.  That means the statement which sets your employees global variable is run.  As a result, the assignment2-test.py can reference this global variable too -- and it does.  If you forget to set this variable in your program, the test reports an error.\n\n### **Task 3: Find the Column Index**\n\n1. Create a function called column_index.  The input is a string.  The function looks in employees[\"fields\"] (an array of column headers) to find the index of the column header requested.  There won't be much to this function, because you just use the index() method of the list class, like so:\n```python\nemployees[\"fields\"].index(\"first_name\")\n```\nThe index() method returns the index of the matching value from the list.\n\n2. The column_index function should return this index.\n\n3. Run the test again to see if the test passes.\n\n4. Call the column_index function in your program, passing the parameter \"employee_id\".  Store the column you get back in a variable called employee_id_column.  This global value is used for subsequent steps.\n\n### **Task 4: Find the Employee First Name**\n\n1. Create a function called first_name.  It takes one argument, the row number.  The function should retrieve the value of first_name from a row as stored in the employees dict.\n\n2. You should first call your column_index function to find out what column index you want.\n\n3. Then you go to the requested row as stored in the employees dict, and get the value at that index in the row.\n\n4. Return the value.\n\n5. Try the test again.\n\n\n### **Task 5: Find the Employee: a Function in a Function**\n\n1. Create a function called employee_find.  This is passed one argument, an integer.  Just call it employee_id in your function declaration. We want it to return the rows with the matching employee_id.  There should only be one, but sometimes a CSV file has bad data.\n\n2. We could do this with a loop.  But we are going to use the filter() function.  Inside the employee_find function (yes, you do declare functions inside functions sometimes), create the following employee_match function:\n```python\ndef employee_match(row):\n   return int(row[employee_id_column]) == employee_id\n```\nThis function is referencing the employee_id value that is passed to the employee_find function.  It can access that value because the employee_match function is inside the employee_find function.  Note that we need to do type conversion here, because the CSV reader just returns strings as the values in the roows.  This inner function returns True if there is a match.  We are using the employee_id_column global value you set in Task 3.\n\n3. Now, still within the employee_find function, call the filter() function.  This is another one of those Python free standing functions.  (It is not a method of the list class.)  You call filter() as follows:\n```python\nmatches=list(filter(employee_match, employees[\"rows\"]))\n```\nThe filter() function needs to know how to filter, and the employee_match function provides that information.  The filter() function calls employee_match once per row, saying, Do we want this one?  When the filter function completes, we need to do type conversion to convert the result to a list.\n\n4. The employee_find function then returns the matches.\n\n5. Run the test and see if you got it right.\n\n### **Task 6: Find the Employee with a Lambda**\n\nThe employee_match function is a silly one-liner.  Lambdas allow us to give the logic inline.\n\n1. Create a function employee_find_2.  This function does exactly what employee_find does -- but it uses a lambda.\n```\ndef employee_find_2(employee_id):\n   matches = list(filter(lambda row : int(row[employee_id_column]) == employee_id , employees[\"rows\"]))\n   return matches\n```\n\nNote that there is no return statement in the lambda.  There is the parameter passed to the lambda (a row), followed by a colon, followed by the expression that gives the result.\n\n2. Run the test to make sure things still work.\n\n\n### **Task 7: Sort the Rows by last_name Using a Lambda**\n\nWe want to call the sort() method on the rows.  However, we need to tell it which column to use for the sort.\n\n1. Create a function sort_by_last_name.  It takes no parameters.  You sort the rows you have stored in the dict.\n\n2. Within the function, you call employees[\"rows\"].sort().  This sorts the list of rows in place. But, you need pass to the list.sort() method a keyword argument called key (so you pass a parameter with `key=` when you call it).  You set that keyword parameter equal to a lambda.  The lambda is passed the row, and the expression after the colon gives the value from the row to be used in the sort.  You might want to use your column_index function for last_name so you know which value from the row should be given in the lambda expression.  Remember that the `sort()` method sorts the list in place and does not return the sorted list.\n\n3. The sort_by_last_name function returns the sorted list of rows.\n\n4. Run the test until this works.\n\n5. Call the function in your program, and then print out the employees dict, to see it in sorted form.\n\n### **Task 8: Create a dict for an Employee**\n\n1. Create a function called employee_dict.  It is passed a row from the employees dict (not a row number).  It returns a dict.\n   - The keys in the dict are the column headers from employees[\"fields\"].\n   - The values in the dict are the corresponding values from the row.\n   - Do not include the employee_id in the dict.  You skip that field for now.\n\n2. Return the resulting dict for the employee.\n\n3. Add a line to your program that calls this function and prints the result.  Use a row from the rows stored in the employees dict to pass to the function for this test.\n\n4. Get the test working.\n\nIf you want to try something extra, look up the `zip()` function, which can be used to simplify the code for this problem.\n\n### **Task 9: A dict of dicts, for All Employees**\n\n1. Create a function called all_employees_dict.\n   - The keys in the dict are the employee_id values from the rows in the employees dict.\n   - For each key, the value is the employee dict created for that row.  (Use the employee_dict function you created in task 8.)\n\n2. The function should return the resulting dict of dicts.\n\n3. Add a line to your program that calls this function and prints the result.\n\n4. Get the test working.\n\n### **Task 10: Use the os Module**\n\nSometimes the behavior of a program is to be modified without changing the program itself.  One way is to use environment variables.  Environment variables are also used to store secrets needed by the program, such as passwords.  Environment variables are accessed via the `os.getenv()` function.  Of course, there are many other functions in the os package.\n\n1. Within the terminal, enter the command `export THISVALUE=ABC`.\n\n2. Add a line to `assignment2.py` to import the os module.\n\n3. Create a function get_this_value().  This function takes no parameters and returns the value of the environment variable `THISVALUE`.\n\n4. Get the test working.  (Note that each time you want this test to pass, you have to have the `THISVALUE` environment variable set in your terminal session.)\n\n### **Task 11: Creating Your Own Module**\n\n1. In the same folder, create a file called custom_module.py, with the following contents:\n\n```python\nsecret = \"shazam!\"\n\ndef set_secret(new_secret):\n   global secret\n   secret = new_secret\n```\n\n2. Add the line `import custom_module` to assignment2.py.\n\n3. Create a function called set_that_secret.  It should accept one parameter, which is the new secret to be set.  It should call custom_module.set_secret(), passing the parameter, so as to set the secret in custom_module.\n\n4. Add a line to your program to call set_that_secret, passing the new string of your choice.\n\n5. In another line, print out custom_module.secret.  Verify that it has the value you expect.\n\n6. Run the test until the next part passes.\n\n\n### **Task 12: Read minutes1.csv and minutes2.csv**\n\nThe \"story\" behind the following list of tasks is as follows.  A club meets, and for each meeting, there is a chairperson.  The club keeps several notebooks that record who whas the chairperson on a given date.  Some of the information is in one notebook, some in the other.  The club now wants to combine this information, to get the list of chairpersons sorted by date.  But the information in the csv files contains duplicates and is in no particular order.  (Yeah, the story is lame, but it is similar to other data analysis tasks.)\n\n1. Create a function called `read_minutes`.  It takes no parameters.  It creates two dicts, minutes1 and minutes2, by reading `../csv/minutes1.csv` and `../csv/minutes2.csv`.  Each dict has `fields` and `rows`, just as the employees dict had.  However! As you create the list of rows for both minutes1 and minutes2, convert each row to a tuple.  The function should return both minutes1 and minutes2.  **Note** You can return several values from a Python function, as follows: `return v1, v2`.  Don't worry about duplicates yet.  They will be dealt with in later tasks.  Think about the DRY (Don't repeat Yourself principal).  You may want to create a helper function to avoid duplicating code.\n\n2. Call the function within your assignment2.py script.  Store the values from the values it returns in the global variables minutes1 and minutes2. **Note** When a function returns several values, you get them as follows: `v1, v2 = function()`. Print out those dicts, so that you can see what's stored.\n\n3. Run the test until this part passes.\n\n### **Task 13: Create minutes_set**\n\n1. Create a function called `create_minutes_set`.  It takes no parameters. It creates two sets from the rows of minutes1 and minutes2 dicts.  (This is just type conversion.  However, to make it work, each row has to be hashable!  Sets only support hashable elements.  Lists aren't hashable, so that is why you stored the rows as tuples in Task 10.)  Combine the members of both sets into one single set.  (This operation is called a union.)  The function returns the resulting set.\n\n2. Call the function within your assignment2.py script.  Store the value returned in the global variable minutes_set.\n\n3. Run the test until the next part passes.\n\n### **Task 14: Convert to datetime**\n\n1. Add a statement, `from datetime import datetime`, to your program.  The datetime module has some nice capabilities for converting strings to dates.  You can look them up: strptime() and strftime().\n\n2. Create a function called create_minutes_list.  It takes no parameters, and does the following:\n   - Create a list from the minutes_set.  This is just type conversion.\n   - Use the `map()` function to convert each element of the list.  At present, each element is a list of strings, where the first element of that list is the name of the recorder and the second element is the date when they recorded.\n   - The map() should covert each of these into a tuple.  The first element of the tuple is the name (unchanged).  The second element of the tuple is the date string converted to a datetime object.\n   - You convert the date strings into datetime objects using `datetime.strptime(string, \"%B %d, %Y\")`.\n   - So, you could use the following lambda:\n   `lambda x: (x[0], datetime.strptime(x[1], \"%B %d, %Y\"))`\n   - The function should return the resulting list.\n\n3. Call the function from within your program.  Store the return value in the minutes_list global.  Print it out, so you can see what it looks like.\n\n4. Run the test until the next part passes.\n\n### **Task 15: Write Out Sorted List**\n\n1. Create a function called write_sorted_list.  It takes no parameters.  It should do the following:\n   - Sort minutes_list in ascending order of datetime.\n   - Call map again to convert the list.  In this case, for each tuple, you create a new tuple.  The first element of the tuple is the name (unchanged).  The second element of the tuple is the datetime converted back to a string, using `datetime.strftime(date, \"%B %d, %Y\")`\n   - Open a file called `./minutes.csv`.  Use a csv.writer to write out the resulting sorted data.  The first row you write should be the value of `fields` the from minutes1 dict.  The subsequent rows should be the elements from minutes_list.\n   - The function should return the converted list.\n\n2. Call this function from within your program.  Then check that the file is created, and that it contains appropriate content.\n\n3. Run the test again until the next test has passed.\n\n### Check for Understanding\n\n1. You created the minutes_set from several lists.  You then created a list from the set.  What's the point of the set, if you're going to end up with a list?\n\n2. Why did you subsequently need to create the list called minutes_list?  Couldn't you just keep working with the set?\n\n3. Why did you need to convert the date strings to datetime objects?\n\n4. Why did you convert them back to strings before writing out the CSV?\n\n\n### Answers\n\n1. The original lists had duplicates.  A set has only unique values, so by converting to a set, you get rid of duplicates.\n\n2. You need to call the map() function and sort() method.  Set objects don't support these, and in fact, the entries in a set are not in any particular order.  So, for these steps, you need lists.\n\n3. You needed to convert the date strings to datetime objects.  Otherwise, they'd just be sorted in alphabetical order, and \"April 1, 2023\" would come before \"September 2, 1980\".  You could have done this conversion in the lambda for `key=` in the sort() of the list, but that approach would make that lambda a little complicated.\n\n4. When a datetime object is printed, its appearance is not as friendly as the original date string, so you converted it back.\n\n\n### **Step 2: Submit Your Assignment on GitHub**  \n\n**Follow these steps to submit your work:**  \n\n#### **1️⃣ Add, Commit, and Push Your Changes**  \n- Within your python_homework folder, do a git add and a git commit for the files you have created, so that they are added to the `assignment2` branch.\n- Push that branch to GitHub. \n\n#### **2️⃣ Create a Pull Request**  \n- Log on to your GitHub account.\n- Open your `python_homework` repository.\n- Select your `assignment2` branch.  It should be one or several commits ahead of your main branch.\n- Create a pull request.\n\n#### **3️⃣ Submit Your GitHub Link**  \n- Your browser now has the link to your pull request.  Copy that link. \n- Paste the URL into the **assignment submission form**.  \n\n",
        "codeExample": "",
        "_id": "68796c78a4ac7ef2a17a6176"
      }
    ],
    "submissionInstructions": "Please submit on time",
    "checklist": [],
    "checkForUnderstanding": []
  },
  "subsections": [
    {
      "subsectionOrder": 1,
      "title": "Lesson 2",
      "content": "# Lesson 2 — Data Structures and File Handling\n\n## 👀 Reminder: How to Follow This Content\n\n* Start by reading the lesson's **learning objective** in the `Lesson Overview` section. Each weekly assignment will measure your skill related to the learning objective.\n* Lessons are split into **subsections**, labeled like this: `1.1`, `1.2`, etc.\n* Each subsection has a short **supplemental video** that will help you understand the content in that subsection.\n* At the end of each subsection, you'll find a multiple-choice **\"Check for Understanding\"** question. Complete the question and review the material if your answer is not correct!\n* After reading through the lesson content and correctly answering the \"Check for Understanding\" questions, complete the **Weekly Assignment**.\n\nIf you have questions at any point, ask a question in the `discussion` Slack channel or reach out to your mentor!\n\n## Lesson Overview\n\nCongrats, you've made it to Lesson 2! This week, we'll deepen our knowledge of core Python concepts, including dictionaries and lists. We'll also learn how to import **modules**, powerful tools that help your Python projects reach their full potential.\nAdditionally, we’ll learn how to work with the operating system (OS) and virtual environments for more efficient project management.\n\n**Learning objective**: Students will explore various data structures, such as lists, tuples, dictionaries, and sets. They will learn how to read and write data to files and use external modules.  Additionally, they will be introduced to basic OS operations and using virtual environments.\n\nTopics:\n\n* Lists, Tuples, Dictionaries, and Sets: Creating, accessing, and modifying data structures.\n* File Handling: Reading from and writing to text and CSV files.\n* Introduction to Modules & packages: Importing and using Python libraries.\n* Keyboard Input\n* Working with the OS: Interacting with the file system and executing commands.\n* Virtual Environments: Managing dependencies for Python projects.\n\n## 2.1 Lists, Tuples, Dictionaries, and Sets\n\nBefore we talk about lists and tuples, we need to define two new words: \"mutable\" and \"immutable.\"\n\nSomething that is **mutable** can be modified or changed after it is created. Something that is **immutable** cannot be modified or changed after it is created.\n\nImagine a piece of clay (mutable) versus a ceramic statue (immutable):\n\n* Clay can be reshaped, squished, or molded into different forms after it's first created. You can add or remove parts easily.\n* A ceramic statue, once it's fired in a kiln, cannot be changed without breaking it completely.\n\nIn Python programming, here's a concrete example using *mutable* lists and *immutable* tuples:\n\n``` python\n# Mutable example (list)\nfruits = ['apple', 'banana', 'cherry']\nfruits.append('date')  # We can add a new item\nfruits[0] = 'orange'  # We can change an existing item\nprint(fruits)  # Now ['orange', 'banana', 'cherry', 'date']\n\n# Immutable example (tuple)\ncolors = ('red', 'green', 'blue')\n# colors[0] = 'yellow'  # This would cause an error\n# You cannot change the tuple after creation\n```\nStrings are also immutable in Python.  This would cause an error:\n```\ncapital = \"raleigh\"\ncapital[0] = \"R\"\n```\n\n### Lists\n\nA **list** is a *mutable*, ordered collection of items. Lists allow duplicates and can hold items of different types, although typically you’ll find lists containing items of the same type. You can add, remove, or modify elements in a list, making them versatile for storing data that may change.\n\n```python\nfruits = ['apple', 'banana', 'cherry']  # Define a list\nfruits.append('orange')  # Add an item\nprint(fruits)  # Output: ['apple', 'banana', 'cherry', 'orange']\n```\n\n#### Key List Methods\n\n* `append(item)`: Adds `item` to the end of the list.\n* `remove(item)`: Removes the first occurrence of `item`.\n* `sort()`: Sorts the list in place.\n\nThere lots of methods and operations which apply to lists including all of the [common](https://docs.python.org/3/library/stdtypes.html#typesseq-common) and [mutable](https://docs.python.org/3/library/stdtypes.html#typesseq-mutable) sequence operations.\n\nA list is an example of an iterable.  So you can iterate on it, as follows:\n\n```python\nfruits = ['apple', 'banana', 'cherry']\nfor fruit in fruits:\n    print(fruit)\n```\nThere are various other iterable collections in Python, such as tuples.\n\n#### The map() Function for Lists.\n\nThe map() function is not a method of the list class.  It is a Python built in function that operates on iterables. Suppose you have a list of numbers, and you want to increment all of them.  You can do it as follows:\n\n```python\nlist_one = [3,4,5]\ndef incrementor(x):\n    return x + 1\n\nlist_two = list(map(incrementor, list_one)) # [4,5,6]\n```\n\nYou pass the map() function two arguments, the function that changes the list item, and the iterable itself.  The function returns an iterable, and we can do type coversion to create a list.  Now, the incrementor() function above looks a little stupid.  You'd like to pass something in line, and for that, Python provides:\n\n### Lambdas\n\n```python\nlist_one = [3,4,5]\nlist_two = list(map(lambda x: x+1, list_one)) # [4,5,6]\n```\n\nThe lambda feature is a way to declare a simple function.  Lambdas are, in some respects, similar to arrow functions in JavaScript, but they are much more limited.  A lambda is a simple one liner.  The syntax is as follows: the word `lambda` followed by the arguments to be passed (the map function only passes one parameter, so in the case above there is only argument for the lambda), followed by a colon `:`, followed by an expression.  The value of the expression is what is returned by the lambda.  You can only give one expression in a lambda, so there is no room for multiple statements.\n\n### Slicing Lists\n\nYou can create a subset list from a list by slicing.  Here are examples:\n\n```python\nlist_1 = ['A','B','C','D','E']\nlist_2 = list_1[1:3] # Slicing from beginning to end. Gives ['B','C'].  list_1[3] is not included.\nlist_3 = list_1[2:]  # Gives ['C','D','E']\nlist_4 = list_1[:2]  # Gives ['A', 'B']\nlist_5 = list_1[-2:] # Gives ['D', 'E'] -- the last two elements\n\n### Tuples\n\nA **tuple** is an *immutable*, ordered collection of items. Once defined, the elements in a tuple cannot be modified, added, or removed. Tuples are useful for data that shouldn’t change, like fixed configuration values or coordinates.\n\n```python\ndimensions = (1920, 1080)  # Define a tuple\nprint(dimensions[0])  # Access the first element: Output: 1920\n```\n\n#### Why use tuples?\n\n* Tuples are memory-efficient compared to lists.\n* Useful when you want a constant, fixed-size collection of data.\n\n### Dictionaries\n\nA **dictionary** is an unordered collection of key-value pairs. Each key is unique and used to store and retrieve data efficiently. Dictionaries are ideal for mapping relationships, such as a user’s name to their profile data or an item to its price.\n\n```python\nperson = {'name': 'Jazmine', 'age': 30}  # Define a dictionary\nprint(person['name'])  # Output: Jazmine\nperson['email'] = 'jazmine@example.com'  # Add a new key-value pair\n```\n\n#### Key Dictionary Methods\n\n* `keys()`: Returns a list of keys in the dictionary.\n* `values()`: Returns a list of values.\n* `items()`: Returns an iterable over the key, value pairs in the dictionary\n* `get(key)`: Returns the value associated with `key`, or `None` if `key` is not found.\n\nThe operations and methods available for dictionaries are documented [here](https://docs.python.org/3/library/stdtypes.html#mapping-types-dict).\n\n### Sets\n\nA **set** is an unordered collection of unique elements. Sets are useful for removing duplicates from a list or performing mathematical set operations like union, intersection, and difference.\n\n```python\nunique_numbers = {1, 2, 3, 3, 4}  # Define a set (duplicates are ignored)\nunique_numbers.add(5)  # Add a new item\nprint(unique_numbers)  # Output: {1, 2, 3, 4, 5}\n```\n\n#### Common Set Operations\n\n* `union()`: Returns a set containing all unique elements from both sets.\n* `intersection()`: Returns elements common to both sets.\n* `difference()`: Returns elements present in one set but not the other.\n\nSet operations and methods are documented [here](https://docs.python.org/3/library/stdtypes.html#set-types-set-frozenset).\n\n### Review Table: Lists, Tuples, Dictionaries, and Sets\n\nOk, let's review! Here's a table demonstrating the key differences between the four new terms we just learned:\n\n| Data Structure | Ordered | Changeable (Mutable) | Allows Duplicates | Key-Value Pairs |\n|----------------|---------|----------------------|-------------------|-----------------|\n| **List**       | Yes     | Yes                 | Yes               | No              |\n| **Tuple**      | Yes     | No                  | Yes               | No              |\n| **Dictionary** | No      | Yes (Keys: No)      | Keys: No, Values: Yes | Yes           |\n| **Set**        | No      | Yes                 | No                | No              |\n\n### 2.1 Video: Lists, Tuples, Dictonaries, and Sets\n\nVideo 2.1 explains lists, sets, and tuples. \n\n**[View the video here](https://youtu.be/gOMW_n2-2Mw?feature=shared).**\n\n### 2.1 Check for Understanding\n\n**Question**: Which of the following statements about Python data structures is correct?\n\n* A) Lists are immutable, and tuples are mutable.\n* B) Sets allow duplicate elements.\n* C) Dictionaries store data in key-value pairs and do not allow duplicate keys.\n* D) Tuples are ordered and changeable.\n\n<details>\n\n<summary>Answer</summary>\n\n**Answer**: C) Dictionaries store data in key-value pairs and do not allow duplicate keys.\n\n</details>\n\n## 2.2 File Handling\n\nIn Python, reading from and writing to text files is handled with the `open()` function. Text files are simple, containing plain text data, making them ideal for storing simple logs, configuration data, or notes.\n\n#### Reading a Text File\n\nTo read a file, use `open()` with the `\"r\"` (read) mode and call `.read()`, `.readline()`, or .`readlines()` to get the content.\n\n```python\nwith open('example.txt', 'r') as file:\n    content = file.read()  # Read entire file\n    print(content)\n```\n\nThe python above uses the `with` statement.  This is a way to keep your code looking clean.  You always want to close the file when you are done.  The `with` statement closes it for you on exit from the block.  The file is closed even if there is an exception, but the exception is still passed on to you.  Later in the course, you will also use the `with` statement for a database connection, and it serves the same purpose.\n\nFile operations, including the open(), can raise exceptions.  To make your code robust, you put them in a try block, as follows:\n\n```python\ntry:\n    with open('example.txt', 'r') as file:\n        content = file.read()  # Read entire file\n        print(content)\nexcept Exception as e:\n    print(f\"An error occurred reading the file: {e}\")\nelse:\n    print(\"The file was read ok.\")\n```\nIf your `with` block is longer, you may have other try blocks inside it for more granular exception handling.\n\n#### Writing to a Text File\n\nTo write to a file, open it in `\"w\"` (write) or `\"a\"` (append) mode. Writing mode will overwrite the file if it exists, while append mode will add to the file.\n\n```python\nwith open('example.txt', 'w') as file:\n    file.write(\"Hello, World!\")  # Write to the file\n```\n\nThe `write()` method does not add a newline after the string which is provided.  The special character `'\\n'` can be added to the end of the string to add a newline.\n\n#### Additional Modes\n\n* `\"r+\"`: Read and write\n* `\"a\"`: Append to the file (keeps existing content).\n\n### Reading and Writing CSV Files\n\nCSV (Comma-Separated Values) files are commonly used to store tabular data, where each row is a new line, and each value is separated by a comma. Python’s built-in `csv` module makes it easy to work with these files.\n\n#### Reading a CSV File\n\nTo read a CSV file, use `csv.reader()` and iterate through the rows.\n\n```python\nimport csv\n\nwith open('example.csv', 'r') as file:\n    reader = csv.reader(file)\n    for row in reader:\n        print(row)\n```\n\n#### Writing to a CSV File\n\nTo write to a CSV file, use `csv.writer()`. Each row should be a list or tuple representing a row in the CSV.\n\n```python\nimport csv\n\nwith open('example.csv', 'w', newline='') as file:\n    writer = csv.writer(file)\n    writer.writerow(['Name', 'Age', 'City'])  # Write header row\n    writer.writerow(['Jazmine', 30, 'New York'])  # Write a data row\n```\n\n#### Additional Options\n\n* `csv.DictReader()` and `csv.DictWriter()`: Use dictionaries to work with row data, which can make reading and writing more convenient when you have headers.\n\n### 2.2 Video: Reading and Writing a CSV File\n\nIn this video, we'll demonstrate reading and writing to a real CSV file. After the video, practice reading and writing to a CSV file using the W3 Resource tutorial [here](https://www.w3resource.com/python-exercises/csv/index.php).\n\n**[View the video here](https://youtu.be/MWYRGLKMzAQ?feature=shared).**\n\n### 2.2 Check for Understanding\n\n**Question**: What does the `\"w\"` mode do when opening a file in Python?\n\n* A) Reads the file without making changes.\n* B) Appends new data to the end of the file.\n* C) Overwrites the file with new data, creating it if it doesn’t exist.\n* D) Opens the file for reading and writing without overwriting.\n\n<details>\n\n<summary>Answer</summary>\n\n**Answer**: C) Overwrites the file with new data, creating it if it doesn’t exist.\n\n</details>\n\n## 2.3 Introduction to Modules\n\nIn Python, modules and packages are essential tools for organizing and reusing code. This section will cover everything you need to know about working with both modules and packages effectively.\n\n### Modules\n\nA module is a Python file containing code (functions, classes, and variables) that can be reused across different parts of a project. Modules help with:\n\n1. **Code Organization**: Breaking large codebases into manageable files\n2. **Reusability**: Using common code wherever needed\n3. **Namespace Management**: Avoiding naming conflicts\n4. **Built-in Functionality**: Accessing Python's standard library features\n\n#### Importing Modules\n\nThere are several ways to import modules:\n\n```python\n# Import entire module\nimport math\nprint(math.sqrt(16))  # Output: 4.0\n\n# Import specific functions\nfrom math import sqrt\nprint(sqrt(16))  # Output: 4.0\n\n# Use aliases for shorter names\nimport pandas as pd\ndf = pd.DataFrame({'Name': ['Jazmine', 'Luis'], 'Age': [30, 35]})\n```\n\n#### Creating Custom Modules\n\nYou can create your own modules by saving Python code in a .py file:\n\n```python\n# math_tools.py\ndef add(a, b):\n    return a + b\n\ndef multiply(a, b):\n    return a * b\n\n# main.py\nimport math_tools\nprint(math_tools.add(2, 3))  # Output: 5\n```\n\n### Packages\n\nA package is a collection of related modules organized in a directory structure. Packages require an `__init__.py` file to mark the directory as a Python package.  In this course, we don't create large projects with many modules, but as a Python professional, you will need to do this.  The contents of `__init__.py` are not described in this lesson, but you can view [this tutorial](https://packaging.python.org/en/latest/tutorials/packaging-projects/) to see how it is to be done (this is optional for this course).\n\n#### Package Structure Example\n```\nmy_package/\n    __init__.py         # Makes this directory a package\n    math_tools.py       # Module for math operations\n    string_tools.py     # Module for string operations\n```\n\n#### Using Packages\n\n```python\n# Import specific modules from a package\nfrom my_package import math_tools\nprint(math_tools.add(10, 20))\n\n# Import specific functions (if configured in __init__.py)\nfrom my_package import add, multiply\n```\n\n### Types of Modules\n\n1. **Standard Library**: Provides a vast library of modules and infrastructure.  It is documented [here](https://docs.python.org/3/library/index.html). Examples of built-in modules include:\n   - `datetime` for dates and times\n   - `json` for JSON data\n   - `os` for operating system operations\n\n2. **External Libraries**: Additional modules installed via pip:\n   ```bash\n   pip install requests\n   \n   # Then use in code:\n   import requests\n   response = requests.get('https://api.example.com/data')\n   ```\n\n### 2.3 Video: Python Modules and Libraries\n\nWhat are Python modules? How do you import and work with them? Check out vido 2.3 to learn more. \n\n**[View the video here](https://youtu.be/XcfxkHrHTVE?feature=shared).**\n\n### 2.3 Check for Understanding\n\n**Question**: Which of the following commands correctly imports only the sqrt function from the `math` module?\n\n* A) `import sqrt from math`\n* B) `from math import sqrt`\n* C) `import math.sqrt`\n* D) `import math as sqrt`\n\n<details>\n\n<summary>Answer</summary>\n\n**Answer**: B) `from math import sqrt`\n\n</details>\n\n## 2.4 Keyboard Input\n\nIn Python, handling keyboard input is straightforward, making it easy to interact with users. The input() function is the main way to capture user input from the keyboard, which you can then use directly or store in a variable for further processing.\n\n#### Using `input()`\n\nThe `input()` function displays a prompt (optional) and waits for the user to type something and press Enter. By default, `input()` captures the input as a string, so if you need it in another format (like an integer), you’ll have to convert it.\n\n```python\nname = input(\"Enter your name: \")  # Displays a prompt and waits for input\nprint(f\"Hello, {name}!\")  # Greets the user with their input\n```\n\n#### Converting Input Types\n\nSince `input()` returns data as a string, you’ll often want to convert it for calculations or comparisons.\n\n```python\nage = input(\"Enter your age: \")  # Gets input as a string\nage = int(age)  # Converts input to an integer\nprint(f\"Next year, you will be {age + 1} years old.\")\n```\n\nIf the user types something that can’t be converted (e.g., entering \"twenty\" instead of \"20\"), this will raise an error. To handle this gracefully, you can use `try-except`:\n\n```python\ntry:\n    age = int(input(\"Enter your age: \"))\n    print(f\"Next year, you will be {age + 1} years old.\")\nexcept ValueError:\n    print(\"Please enter a valid number.\")\n```\n\n### Example: Simple Calculator Using Keyboard Input\n\nHere’s a basic example that combines multiple `input()` calls to create a calculator. Pay attention to this code, because you'll be creating a calculator in this week's assignment!\n\n```python\n# Simple calculator\ntry:\n    num1 = float(input(\"Enter the first number: \"))\n    num2 = float(input(\"Enter the second number: \"))\n    operation = input(\"Enter an operation (+, -, *, /): \")\n\n    if operation == \"+\":\n        print(\"Result:\", num1 + num2)\n    elif operation == \"-\":\n        print(\"Result:\", num1 - num2)\n    elif operation == \"*\":\n        print(\"Result:\", num1 * num2)\n    elif operation == \"/\":\n        print(\"Result:\", num1 / num2)\n    else:\n        print(\"Invalid operation\")\nexcept ValueError:\n    print(\"Please enter valid numbers.\")\nexcept ZeroDivisionError:\n    print(\"Cannot divide by zero.\")\n```\n\n### 2.4 Check for Understanding\n\n**Question**: Which of the following statements about `input()` in Python is correct?\n\n* A) `input()` captures user input and automatically converts it to an integer.\n* B) `input()` displays a prompt and captures user input as a string by default.\n* C) `input()` captures user input but only works with numbers.\n* D) `input()` is used to output text to the console.\n\n<details>\n\n<summary>Answer</summary>\n\n**Answer**: B) input() displays a prompt and captures user input as a string by default.\n\n</details>\n\n## 2.5 Working with the OS\n\nThe `os` module in Python provides a powerful interface for interacting with the operating system. It enables you to perform various tasks, including:\n\n* File and directory manipulation\n* Environment variable handling\n* Running system commands\n\nThese functionalities are essential for automating processes and managing files within Python programs.\n\n### Common os Module Functions\n\n**Getting the Current Working Directory**\n\nThe `os.getcwd()` function retrieves the path of the current working directory (the directory from which your Python script is executing).\n\n```python\nimport os\ncurrent_directory = os.getcwd()\nprint(f\"Current working directory: {current_directory}\")\n```\n\n**Changing the Current Working Directory**\n\nYou can change the current working directory using `os.chdir(path)`, where `path` specifies the directory you want to switch to.\n\n```python\nos.chdir('/path/to/your/folder')\nprint(f\"New working directory: {os.getcwd()}\")\n```\n\n**Listing Files in a Directory**\n\nThe `os.listdir()` function returns a list containing all files and folders within the specified directory.\n\n```python\nfiles = os.listdir('/path/to/your/folder')\nprint(f\"Files in the directory: {files}\")\n```\n\n**Creating and Removing Directories**\n\nUse `os.mkdir()` to create a new directory and `os.rmdir()` to remove an empty directory.\n\n```python\n# Create a new directory\nos.mkdir('new_folder')\n\n# Remove the directory\nos.rmdir('new_folder')\n```\n\n*Note: If the directory isn't empty, you'll encounter an error. To remove a non-empty directory, use `shutil.rmtree()` from the `shutil` module.*\n\n**Checking if a Path Exists**\n\nUse `os.path.exists()` to verify if a file or directory exists at the specified path.\n\n```python\nif os.path.exists('some_file.txt'):\n    print(\"The file exists.\")\nelse:\n    print(\"The file does not exist.\")\n```\n\n**Getting File Information**\n\nThe `os.path` module provides functions to check file properties. For instance, use `os.path.isfile()` to determine if a path points to a file and `os.path.isdir()` to check if it's a directory.\n\n```python\nif os.path.isfile('some_file.txt'):\n    print(\"This is a file.\")\nelif os.path.isdir('some_folder'):\n    print(\"This is a folder.\")\n```\n\n**Executing Shell Commands**\n\nThe `os.system()` function allows you to execute shell commands from within your Python program. You can leverage this functionality to run system commands like `ls` or `dir` to list files or execute other commands provided by your operating system.\n\n```python\nos.system('ls')  # For Linux/Mac\nos.system('dir')  # For Windows\n```\n\n*Keep in mind that `os.system()` doesn't return the output of the command. If you need the output, consider using `subprocess.run()` instead.*\n\n**Environment Variables**\n\nYou can access environment variables using `os.environ`. For example, to retrieve the `PATH` environment variable:\n\n```python\npath_variable = os.environ.get('PATH')\nprint(path_variable)\n```\n\n**Addendum: The sys Package**\n\nIn many environments, Python is used as a scripting tool.  Python scripts are invoked with arguments.  The user might type:\n\n```bash\npython loadfile.py ./current.csv\n```\nand the script might load the contents of the file into a database.  The sys package enables this (among other things).  Consider the following code:\n\n```python\nimport sys\nfor arg in sys.argv:\n    print(arg)  # arg[0] is the program name.  The other arguments are what was passed on the command line.\n```\n\nThe [argparse](https://docs.python.org/3/library/argparse.html#module-argparse) module provides a powerful framework for handling command line arguments.\n\n### Video 2.5: Working with `os`\n\n**[Watch an overview of working with the `os` module here](https://youtu.be/tJxcKyFMTGo?feature=shared).**\n\n---\n\n## 2.6 Virtual Environments\n\nVirtual environments are a cornerstone of Python development, particularly when managing dependencies and isolating project environments. A virtual environment creates an isolated Python environment, enabling you to have project-specific dependencies that won't interfere with other projects or system-wide Python packages.\n\n### Why Use Virtual Environments?\n\n* **Isolation**: Virtual environments ensure that each project has its own set of dependencies, preventing version conflicts.\n* **Reproducibility**: Virtual environments make it simpler to reproduce the exact setup for a project on another machine.\n* **Dependency Management**: You can install and update packages without affecting other projects or your system's Python installation.\n\n### Setting Up a Virtual Environment\n\n1. **Install `virtualenv` (optional)**\n\n   While Python 3.3+ comes with the `venv` module for creating virtual environments, some users prefer using `virtualenv` for additional features. To install it:\n\n   ```bash\n   pip install virtualenv\n   ```\n\n2. **Create a Virtual Environment**\n\n   You can create a virtual environment using either `venv` (built-in module) or `virtualenv` (third-party package).\n\n   - **Using `venv`**:\n\n     ```bash\n     python3 -m venv myenv\n     ```\n\n     This command creates a directory named `myenv` that contains the virtual environment.  (Note: by convention, `.venv` is usually used as the name of the virtual environment, instead of `myenv` as in this example.)\n\n   - **Using `virtualenv`**:\n\n     ```bash\n     virtualenv myenv\n     ```\n\n   **In both cases, `myenv` is the directory where the isolated Python environment will live.**\n\n3. **Activating the Virtual Environment**\n\n   To activate the virtual environment, use the following commands:\n\n   * **Windows:**\n     The following command assumes that you are using Git Bash as your Windows development terminal environment.  This is strongly recommended.\n\n     ```bash\n     source myenv/Scripts/activate\n     ```\n\n\n\n   * **Mac/Linux:**\n\n     ```bash\n     source myenv/bin/activate\n     ```\n\n   Once activated, your terminal prompt will usually change to show the virtual environment's name, e.g., `(myenv)`.\n\n4. **Installing Packages in the Virtual Environment**\n\n   After activation, you can install packages as usual with `pip`. These packages will be installed inside the virtual environment, not globally.\n\n   ```bash\n   pip install requests\n   ```\n\n   This ensures that the `requests` package is available only in the current virtual environment.\n\n5. **Deactivating the Virtual Environment**\n\n   To exit the virtual environment and return to the global Python environment, simply run:\n\n   ```bash\n   deactivate\n   ```\n\n6. **Managing Dependencies with `requirements.txt`**\n\n   To record all the dependencies installed in your virtual environment, use the `pip freeze` command to generate a `requirements.txt` file:\n\n   ```bash\n   pip freeze > requirements.txt\n   ```\n\n   This file can be used to recreate the environment on another machine:\n\n   ```bash\n   pip install -r requirements.txt\n   ```\n\n7. **Virtual Environment with IDEs**\n\n   Many IDEs, like VS Code and PyCharm, allow you to configure the Python interpreter to use the virtual environment. This ensures that the IDE uses the correct Python environment with all the necessary packages installed.\n\n### Video 2.6: The Virtual Environment\n\nCheck out Video 2.6 for a quick overview of setting up a virtual environment for Python in VS Code.  Note that you have already done this!  Your python_homework directory uses a virtual environment.\n\n**[Watch the video here](https://youtu.be/GZbeL5AcTgw?feature=shared).**\n\n## 🥳 That's it for Lesson 2!\n\nCheck out this week's coding assignment, and reach out to a mentor if you need help!\n\n---\nThis content was written by Janet Zulu, Reid Russom, and CTD volunteers—with special thanks to the brain trust of John McGarvey, Rebecca Callari-Kaczmarczyk, Tom Arns, and Josh Sternfeld. To submit feedback, please fill out the **[CTD Curriculum Feedback Form](https://forms.gle/RZq5mav7wotFxyie6)**.\n\n",
      "videoUrl": "",
      "codeExamples": [],
      "externalLinks": [],
      "quizzes": [],
      "_id": "68796c78a4ac7ef2a17a6175"
    }
  ]
}