{
  "id": "68796c79a4ac7ef2a17a61a8",
  "lessonNumber": 15,
  "title": "Lesson 15 — Final Project, Week 2",
  "status": "pending",
  "assignment": {
    "title": "Assignment for Lesson 15",
    "objective": "No objective specified",
    "expectedCapabilities": [],
    "instructions": [],
    "tasks": [
      {
        "taskNumber": 1,
        "title": "Task 1",
        "description": "### Project Demo Details\n\nIt is good practice to talk about what you have learned and know about project as you will be asked to talk about your experiences in job interviews.  This is why we ask all students to give a short demo of their final projects.  This demo is NOT graded and your performance in the demo will have no bearing on your graduation.  Please record a 3-5 minute presentation that touches on all of the following:\n - [ ] demonstrate the data visualizations you created with your Kaggle project\n - [ ] demonstrate and describe the workings of your Local Data Scraping project done with Dash or Streamlit\n\nRubric details for the Kaggle Project and Scraping Project can be seen below.  Be sure both your projects meet the requirements specified for each.\n\n### How to record your presentation\nYou can record your presentation in any of these three ways: \n 1. Logging into your personal Zoom account and record your personal meeting where only you are in attendance and you are screensharing your work ([this is a link to a video on how to do this](https://www.youtube.com/watch?v=njwbjFYCbGU))\n 2. Use a screen recording program already on your machine\n    * [Mac users can use this link to watch a how-to video](https://www.youtube.com/watch?v=w9Byefp51tY)\n    * [Windows users can use this link to watch a how-to video](https://www.youtube.com/watch?v=PJB7pM5bvNI)\n 3. Use an online option such as loom ([link to a how to video on loom here](https://www.youtube.com/watch?v=oAdLPbfXcQo)).\n\n### How to upload your video so it can be shared\n<details>\n<summary>Click here to expand detailed instructions on how to upload your recording</summary>\n<br>\n<h4>1. Make sure you're logged in to youtube.</h4>\n <p>If you don't have a youtube account, <a href=\"https://support.google.com/youtube/answer/161805?hl=en&co=GENIE.Platform%3DDesktop\">create one by following these instructions</a>.</p>\n <p>You will know you're logged in if you have an initial/icon/other in the top right corner (where the M in the brown circle is on this screenshot):</p>\n \n ![User logged in to youtube account](https://github.com/Code-the-Dream-School/intro-to-programming-2025/blob/d2f9b35d7206eeb0af24f85a8e8e5d97d43cbfad/images/Screenshot%202025-01-27%20at%204.01.20%E2%80%AFPM.png?raw=true)\n\n <h4>2. Click `+ Create` in the top right and select `Upload video`</h4>\n \n ![Create menu expanded](https://github.com/Code-the-Dream-School/intro-to-programming-2025/blob/d2f9b35d7206eeb0af24f85a8e8e5d97d43cbfad/images/Screenshot%202025-01-27%20at%204.01.27%E2%80%AFPM.png?raw=true)\n\n <h4>3. In the Upload videos window that appears, click the black `Select files` button</h4>\n <p>You'll need to select the file of your recording you have saved on your computer.</p>\n \n ![Upload videos modal](https://github.com/Code-the-Dream-School/intro-to-programming-2025/blob/d2f9b35d7206eeb0af24f85a8e8e5d97d43cbfad/images/Screenshot%202025-01-27%20at%204.01.35%E2%80%AFPM.png?raw=true)\n\n<h4>4. The fle title will be the default video title.  You can change this to include your name and \"Python Essentials Final Projects Presentation\"</h4>\n\n![Edit Video Details title](https://github.com/Code-the-Dream-School/intro-to-programming-2025/blob/d2f9b35d7206eeb0af24f85a8e8e5d97d43cbfad/images/Screenshot%202025-01-27%20at%204.02.17%E2%80%AFPM.png?raw=true)\n\n<h4>5. Scroll down under the title; select \"No, it's not made for kids\" and click on the `Show more` gray button to make further setting changes</h4>\n\n![Adjust video settings](https://github.com/Code-the-Dream-School/intro-to-programming-2025/blob/d2f9b35d7206eeb0af24f85a8e8e5d97d43cbfad/images/Screenshot%202025-01-27%20at%204.02.30%E2%80%AFPM.png?raw=true)\n\n<h4>6. You'll want to be sure the following options for some of the sections that appear after click `Show more` are set to the following:</h4>\n\n - [ ] Altered content: select \"No\" since you have not used AI to alter reality in your video\n \n - [ ] Recording date and location: please select the date you made your final project recording\n      \n - [ ] Shorts remixing: select \"Don't allow remixing\"\n       \n - [ ] Comments and ratings: if you would like classmates to leave comments, leave comments \"On\", otherwise you can turn them off by selecting \"Off\".  _NOTE: we do not and cannot monitor comments.  Please report anything concerning to Code the Dream but have screenshots if needed._  You can also UNcheck the \"Show how many viewers like this video if you wish.\n       \n - [ ] Click the black `Next` button in the bottom right to proceed from the Details section of the upload through the Video elements and Checks portion.\n       \n - [ ] Once you are on the Visibility section of the upload, select \"Unlisted\" as seen here\n\n![Select Unlisted](https://github.com/Code-the-Dream-School/intro-to-programming-2025/blob/d2f9b35d7206eeb0af24f85a8e8e5d97d43cbfad/images/Screenshot%202025-01-27%20at%204.04.52%E2%80%AFPM.png?raw=true)\n\n - [ ] Lastly, click `Save` and copy your video link as seen here\n\n![Save and copy](https://github.com/Code-the-Dream-School/intro-to-programming-2025/blob/d2f9b35d7206eeb0af24f85a8e8e5d97d43cbfad/images/Screenshot%202025-01-27%20at%204.05.09%E2%80%AFPM.png?raw=true)\n \n</details>\n\n### Submitting your recording\n**Once you have recorded your presentation, please include the youtube link to your presentation in your Assignment Submission Form for this week.  Your assignment submission form this week will have you share the link to your Kaggle Project, the link to your repo that holds your Local Data Scraping Project, and a place for you to share your video recording link.**\n\n### See below for rubrics for your final projects:\n\n<details>\n<summary>Scraping Project Rubric</summary>\n* **Web Scraping**\n\n    * [ ] Uses appropriate libraries (Selenium) to retrieve data from the web\n    * [ ] Handles common scraping challenges like missing tags, pagination, and user-agent headers\n    * [ ] Saves raw data in a structured format such as .csv or .json\n    * [ ] Avoids scraping duplication or redundant requests\n\n* **Data Cleaning & Transformation**\n\n    * [ ] Loads raw data into a Pandas DataFrame or equivalent structure\n    * [ ] Cleans missing, duplicate, or malformed entries effectively\n    * [ ] Applies appropriate transformations, groupings, or filters\n    * [ ] Shows before/after stages of cleaning or reshaping\n\n* **Data Visualization**\n\n    * [ ] Includes at least three visualizations using Plotly, Streamlit, or Dash\n    * [ ] Visuals are relevant, well-labeled, and support the data story\n    * [ ] User interactions such as dropdowns or sliders are implemented\n    * [ ] Visualizations respond correctly to user input or filters\n\n* **Dashboard / App Functionality**\n\n    * [ ] Built with Streamlit or Dash to display data and insights\n    * [ ] Features clean layout and responsive components\n    * [ ] Allows users to explore different aspects of the data\n    * [ ] Provides clear titles, instructions, and descriptions for user guidance\n\n* **Code Quality & Documentation**\n\n    * [ ] Code is well-organized and split into logical sections or functions\n    * [ ] Inline comments or markdown cells explain major steps or choices\n    * [ ] All dependencies are listed and environment setup is reproducible\n    * [ ] Comments or markdown cells explain logic\n    * [ ] `README.md` includes summary, setup steps, and a screenshot  \n</details>\n\n<details>\n<summary>Kaggle Final Project Rubric</summary>\n ## Kaggle Project Rubric\n\n* **General Code Quality**\n\n    * [ ]  Code demonstrates a strong understanding of Python basics. \n    * [ ]  Code is well organized and documented with comments.\n    * [ ]  Functions are used to structure and organize the code.\n\n* **File Handling and Data Loading**\n\n    * [ ]  Data is loaded from appropriate file formats (CSV, JSON, etc.) using Pandas.\n    * [ ]  File paths and loading procedures are clearly defined and handled robustly.\n    * [ ]  Demonstrates effective use of Pandas `read_csv()`, `read_json()`, or similar functions.\n    * [ ]  Uses `head()`, `tail()`, and `info()` effectively to preview and inspect the data.\n\n* **Data Wrangling and Transformation**\n\n    * [ ]  Demonstrates proficiency in using Pandas for data selection, filtering, and transformation.\n    * [ ]  Implements advanced data manipulation techniques, including indexing, slicing, and data type conversion.\n    * [ ]  Handles missing data effectively using `dropna()` or `fillna()` with appropriate strategies.\n    * [ ]  Identifies and removes duplicate records if necessary using Pandas.\n    * [ ]  Code is efficient, well-documented, and follows Pandas best practices.\n    * [ ]  At least three extracted features\n\n* **Data Aggregation**\n\n    * [ ]  Uses Pandas `groupby()` function effectively to aggregate data and gain insights.\n    * [ ]  Applies a variety of aggregation functions (e.g., `sum()`, `mean()`, `count()`, `min()`, `max()`) to analyze grouped data.\n    * [ ]  Clearly presents and interprets the results of data aggregation.\n    * [ ]  At least 3 aggregations\n\n* **Visualization Quality**\n\n    * [ ]  Creates multiple (3+) high-quality, informative, and visually appealing visualizations using appropriate libraries (e.g., Matplotlib, Seaborn, Plotly).\n    * [ ]  Visualizations are clear, concise, and easy to understand, with appropriate titles, labels, legends, and color schemes.\n    * [ ]  Demonstrates strong understanding of design principles.\n    * [ ]  Provides clear explanations of the insights conveyed by each visualization.\n\n* **Chart Types and Interpretation**\n\n    * [ ]  Uses a diverse range of chart types (e.g., scatter plots, bar charts, histograms, box plots, heatmaps) to provide a comprehensive view of the data.\n    * [ ]  Demonstrates a clear understanding of the strengths and weaknesses of each chart type and selects them strategically.\n    * [ ]  Provides insightful interpretations of the visualizations, connecting them to the data analysis and the problem domain.\n\n* **Dataset and Feature Understanding**\n\n    * [ ]  Uses a dataset that is appropriate for the analysis.\n    * [ ]  Demonstrates a clear understanding of the dataset's characteristics, limitations, and potential biases.\n    * [ ]  Selects and uses a sufficient number of relevant features to support a meaningful analysis.\n\n* **Conclusions and Insights**\n\n    * [ ]  Provides a clear, concise, and insightful summary of the project's key findings and conclusions.\n    * [ ]  Connects the findings to the original problem or question and discusses their implications.\n    * [ ]  Identifies potential limitations of the analysis.\n    * [ ]  Demonstrates a strong understanding of the data's story and effectively communicates it.\n    * [ ]  At least 3 conclusions supported by charts and text.\n\n* **Reproducibility**\n\n    * [ ]  Provides a well-organized and clearly documented notebook or script that allows others to easily reproduce the entire analysis.\n    * [ ]  All dependencies are clearly specified.\n\n</details>\n</br>\n\nUse this [link for the final project submission form](https://airtable.com/appoSRJMlXH9KvE6w/shrthD4fozy4UI21I?prefill_Lessons=Python%20100%20v1:%20Lesson%2015%20-%20Project%20Completion%20and%20Presentations) for your Kaggle, Web scraping, and presentation video.\n",
        "codeExample": "",
        "_id": "68796c79a4ac7ef2a17a61aa"
      }
    ],
    "submissionInstructions": "Please submit on time",
    "checklist": [],
    "checkForUnderstanding": []
  },
  "subsections": [
    {
      "subsectionOrder": 1,
      "title": "Lesson 15",
      "content": "# Lesson 15 — Final Project, Week 2\n\nCongratulations — you've made it to the final week of the course! This week, your goals are:\n1. **Finish and submit your final projects**.\n2. **Record a short project presentation** to share with the rest of the class.\n\nPlease refer to the assignment section below and/or your Week 13 Lesson for Kaggle Project and Week 14 Lesson for your Local Scraping Project to review details and make sure your final projects meet requirements.  Also in the assignment section, you have detailed instructions on how to make and prepare a video of your demonstrated working projects to share with us.   Once you've completed your final projects and video, you'll submit all of these things with your usual Submit Assignment form that you've been using each week.  The form will have additional fields on it to allow you share your Local Scraping Project repo link, your Kaggle link, as well as some information that goes with your video link.  \n\nWhat happens next?\nOnce you've submitted your finals and your video, your reviewer will check your work on your final projects and either declare them needing revisions or being successful, as they have with all your other assignments.  Watch you email for those results.  \n\nTo view your and your classmates' final project presentations, you can visit your class gallery here: [Jamaican Boa Python Essentails Class - Video Demo Gallery](https://airtable.com/appoSRJMlXH9KvE6w/shrqml5HWXby1FzEz/tblTvxLLUlqtgtfbq)\n\nAs always, reach out to a mentor if you need help this week. You're almost there!\n",
      "videoUrl": "",
      "codeExamples": [],
      "externalLinks": [],
      "quizzes": [],
      "_id": "68796c79a4ac7ef2a17a61a9"
    }
  ]
}