{
  "id": "68796c79a4ac7ef2a17a6198",
  "lessonNumber": 11,
  "title": "Lesson 11 — Introduction to Data Visualization",
  "status": "pending",
  "assignment": {
    "title": "Assignment for Lesson 11",
    "objective": "No objective specified",
    "expectedCapabilities": [],
    "instructions": [],
    "tasks": [
      {
        "taskNumber": 1,
        "title": "Task 1",
        "description": "\n# **Assignment 11: Introduction to Data Visualization**\n\nThis assignment is to be implemented in a Kaggle notebook, using a Kaggle dataset.  As usual, mark the section of code that implements each task with a markdown cell.\n\n---\n\n## **Task 1: Data Understanding**\n\n1. In Kaggle, go to the Datasets link on the left side of the page.\n2. Search for \"Diabetes Health Indicators Dataset\".  You should find one from Alex Teboul.\n3. In Data Explorer on the right, click on the one that starts with \"diabetes_012\".\n4. We need to understand particular columns.  Click on the pulldown for the 22 columns. Click on \"Select All\" and then \"Apply\".  Then select \"Column\" from the menu.  This explains the meaning of all the columns.  Scroll down throuh the information about each column.  You see that \"Diabetes_012\" can have 3 numeric values.  You see that \"Age\" is broken down into 13 buckets.  You see that \"GenHlth\" has values from 1 to 5, 5 being worst!  You see that PhysHlth is the number of days in the past month where the person's physical health was not good.  Again, a high number is bad!  We can't understand the plots we make **unless we know what the data means.**\n\n## **Task 2: Creating the Notebook and Loading Data**\n\n1. Create a Kaggle Notebook called \"CTD_Assignment_11\".  Add the \"Diabetes Health Indicators Dataset\".  Run the first cell so that you get the filenames.\n2. Load the one that has \"diabetes_012\" in the name into a `diabetes` DataFrame.\n3. Print out the first 5 lines of the DataFrame.\n\n## **Task 3: A Histogram For Age Distributions**\n\n1. Use Matplotlib to create a histogram of age distributions in the `diabetes` DataFrame, where the X axis is \"Age\" and the Y axis is \"Count\". Give the plot a meaningful title, and give the axes meaningful labels.\n2. Show the plot to see if it is as you expect.\n\n## **Task 4: General Health over Time**\n\n1. Create a `health_by_age` DataFrame, using groupby() on the `diabetes` DataFrame.  Group by age.  Aggregate the `GenHlth` column using `mean`.\n2. Add a column called \"Health\" to the resulting DataFrame.  The value of this should be 5 minus the `GenHlth` column.  It is usually more meaningful to have high values mean good and low values mean bad.\n3. Sort `health_by_age` by the index.  (You use the sort_index() method.)  The index for this DataFrame is \"Age\", because of the groupby().\n4. Use Matplotlib to create a line plot where the X axis is \"Age\" (the index) and the Y axis is \"Health\".  Add a meaningful title and axes labels.\n5. Show the plot. It's kind of a sad story.\n\n## **Task 5: A Heat Map of All Columns**\n\n1. Create a correlation matrix called `diabetes_corr` for all columns.\n2. Use Seaborn to create a heat map from the correlation matrix.  Note: It appears that Seaborn uses some Python deprecated features, so you will see warning messages.  You can ignore these.\n3. Show the heat map.\n\nAs you will notice, this heat map is hard to read.  You solve that problem in the next task by subsetting the correlation matrix.\n\n## **Task 6: Subset Heat Maps**\n\nSuppose you decide that the data you care about most is in the \"Diabetes_012\", \"HeartDiseaseorAttack\", and \"GenHlth\" columns.\n\n1. Create a subset correlation matrix called `diabetes_corr_subset`, selecting these columns from `diabetes_corr`.\n2. Sort this in descending order on the `Diabetes_012` column.\n3. Create a heatmap for the first 10 rows and show it.  These are the factors most strongly correlated with diabetes.\n4. Create a heatmap for the last 10 rows, with an appropriate title, and show it.  These are the factors that are negatively correlated (or weakly correlated) with diabetes.\n5. Sort the matrix again on the \"GenHlth\" column in descending order, and again show heat maps for the first and last 10 rows.\n6. Notice the factors that are most consequential for diabetes and health, according to this dataset.  Add a markdown cell that describes these.\n\n## **Task 7: A Pair Plot: Body Mass Index vs. Age**\n\n1. Using the `diabetes` DataFrame, create a pair plot for \"BMI\" and \"Age\", with a `hue` of \"Diabetes_012\".  I find that `palette=['#FF5733', '#33FF57', '#3357FF']` gives a helpful display.\n2. Give the pair plot a descriptive title and show it.\n3. The plot is hard to read.  There are too many values for BMI.  Use `qcut()` to divide BMI into 10 quantiles, and add the resulting Series to the `d_h_i` DataFrame.  Then plot Age vs. BMI Quantiles, with the same hue as before.\n4. Give this pair plot a descriptive title and show it.\n\n### **Submit the Notebook for Your Assignment**  \n\n📌 **Follow these steps to submit your work:**  \n\n#### **1️⃣ Get a Sharing Link for Your Assignment**  \n- On the upper right of the Kaggle page, click on Save Version and save, accepting all defaults.  You can just do a quick save.\n- On the upper right, click on Share.  Choose Public, make sure that Allow Comments is on, and copy the public URL to your clipboard.\n\n#### **2️⃣ Submit Your Kaggle Link**  \n- Paste the URL into the **assignment submission form**.  \n\n---\n",
        "codeExample": "",
        "_id": "68796c79a4ac7ef2a17a619a"
      }
    ],
    "submissionInstructions": "Please submit on time",
    "checklist": [],
    "checkForUnderstanding": []
  },
  "subsections": [
    {
      "subsectionOrder": 1,
      "title": "Lesson 11",
      "content": "\n# **Lesson 11 — Introduction to Data Visualization**\n\n## **Lesson Overview**\n**Learning objective:** In this lesson, students will learn to create and customize both basic and advanced data visualizations using Python libraries such as Matplotlib and Seaborn. By the end of this lesson, students will be able to effectively tell stories with data using visual representation, enhancing their ability to communicate insights.\n\n### **Topics:**\n1. Introduction to Matplotlib: Creating basic plots (line, bar, histogram).\n2. Customizing Plots: Labels, titles, legends, and colors.\n3. Introduction to Seaborn: Creating advanced visualizations (heatmaps, pair plots).\n4. Advanced Customization: Subplots, color palettes, and annotations.\n\n---\n\n## **10.1 Introduction to Matplotlib**\n\n### **Setup**\n\nYou should run each of the code examples below from within your `python_homework` directory.  You need several additional libraries, so within `python_homework`, do the following:\n\n```bash\npip install matplotlib\npip install seaborn\n```\n\n### **Overview**\nMatplotlib is a foundational Python library for creating static, animated, and interactive visualizations. It is highly customizable and widely used for a variety of chart types, from basic plots to more complex visualizations.\n\n### **Key Plot Types:**\n1. **Line Plot:** Shows trends over time or continuous data.\n2. **Bar Plot:** Compares categorical data.\n3. **Histogram:** Displays the distribution of numerical data.\n\n### **When to Use:**\n- **Line Plot**: Best used when you want to display **trends over time** or track changes in continuous data, such as revenue, stock prices, or temperature variations.\n- **Bar Plot**: Ideal for comparing **categorical data**, such as sales by region, number of items sold by category, or performance scores across different teams.\n- **Histogram**: Used to display the **distribution** of a continuous variable and to detect outliers, skewness, or the normality of data.\n\n### **Example Code: Creating Basic Plots**\n\nThese examples should be run from the Python interactive shell.  Each `show()` operation causes a graphics window to open, and the processing in the shell (or in a Python program running within your terminal) stops until you close that window.  The graphics window has several controls.  One brings up some sliders, allowing you to change the appearance of the chart or plot.  Another button allows you to save the image.  Using these buttons, you can create an image file that might be added to a document or slide or web page.  Experiment with these.  However, don't save the images within the `python_homework` folder, or they'll be delivered to your GitHub repository, and that wouldn't be useful.  For the assignment, you'll display plots using a Kaggle notebook.  When you do that, you don't see these buttons or sliders, and the graphics appear in the notebook itself, not in a separate window.  \n\nHere are the examples you should try.  \n\n```python\nimport matplotlib.pyplot as plt\nimport numpy as np\n\n# Line Plot\nmonths = [\"Jan\", \"Feb\", \"Mar\", \"Apr\", \"May\", \"Jun\"]\nrevenue = [1000, 1200, 1500, 1700, 1600, 1800]\nplt.plot(months, revenue, marker='o', linestyle='-', color='blue')\nplt.title(\"Monthly Revenue\")\nplt.xlabel(\"Months\")\nplt.ylabel(\"Revenue ($)\")\nplt.show()\n\n# Bar Plot\ncategories = [\"Region A\", \"Region B\"]\nsales = [500, 700]\nplt.bar(categories, sales, color=['green', 'orange'])\nplt.title(\"Sales by Region\")\nplt.xlabel(\"Region\")\nplt.ylabel(\"Sales ($)\")\nplt.show()\n\n# Histogram\nrandom_data = np.random.randn(1000)\nplt.hist(random_data, bins=30, color='purple', alpha=0.7)\nplt.title(\"Random Data Distribution\")\nplt.xlabel(\"Value\")\nplt.ylabel(\"Frequency\")\nplt.show()\n```\n\n### **Outcome:** \n- The **Line Plot** illustrates trends over time.\n- The **Bar Plot** compares categorical data.\n- The **Histogram** shows the distribution of random data.\n\nThe third example uses an interesting function, `randn()`.  This gives a random collection of values, but the random values cluster around the average value.  This is called a normal or Gaussian distribution, and many things in nature, such as people's heights, lifetimes of lightbulbs, sizes of snowflakes, and measurement errors in typical experiments, are roughly Gaussian.\n---\n\n## **10.2 Customizing Plots**\n\n### **Overview**\nCustomizations make plots more informative and visually appealing. This includes:\n- Changing colors, line styles, or bar widths.\n- Adding grids to make value estimation easier.\n- Using legends, titles, and labels for better context.\n\n### **When to Customize:**\n- **Line Plot Customization:** Adjust the style (dashed, dotted, solid) and color of the line to match the importance or theme of the data. Adding markers can help highlight key points.\n- **Bar Plot Customization:** Customize the width, color, and edge of bars for visual distinction between categories.\n- **Histogram Customization:** Customize bin sizes, color, and alpha (transparency) to enhance the data’s visibility and readability.\n\nRun these examples in the Python shell.  \n### **Example Code: Customizing Plots**\n```python\nimport matplotlib.pyplot as plt\n\nmonths = [\"Jan\", \"Feb\", \"Mar\", \"Apr\", \"May\", \"Jun\"]\nrevenue = [1000, 1200, 1500, 1700, 1600, 1800]\n\n# Customized Line Plot\nplt.plot(months, revenue, marker='o', linestyle='--', color='red', linewidth=2)\nplt.title(\"Monthly Revenue\", fontsize=14, fontweight='bold')\nplt.xlabel(\"Months\", fontsize=12)\nplt.ylabel(\"Revenue ($)\", fontsize=12)\nplt.grid(color='gray', linestyle='--', linewidth=0.5)\nplt.legend([\"Revenue\"], loc=\"upper left\")\nplt.show()\n\n# Customized Bar Plot\nplt.bar(categories, sales, color=['skyblue', 'salmon'], width=0.5, edgecolor='black')\nplt.title(\"Sales by Region\", fontsize=14, fontweight='bold')\nplt.xlabel(\"Region\", fontsize=12)\nplt.ylabel(\"Sales ($)\", fontsize=12)\nplt.grid(axis='y', color='gray', linestyle='--', linewidth=0.5)\nplt.show()\n```\n\n### **Key Customization Features:**\n- Line Plot customization includes adjusting line style, color, and adding a grid.\n- Bar Plot customization changes the bar color, width, and adds gridlines for better readability.\n\n---\n\n## **10.3 Introduction to Seaborn**\n\n### **Overview**\nSeaborn is a powerful Python visualization library built on top of Matplotlib. It simplifies the creation of complex statistical plots and integrates well with Pandas DataFrames. Seaborn provides better default aesthetics for some plots, making them visually appealing with minimal effort.\n\n### **Key Plot Types:**\n1. **Heatmap:** Visualizes correlation or relationships in tabular data.\n    As was discussed in an earlier lesson, there might be a correlation between variables in a dataset.  Correlations are typically expressed as a number between -1.0 and 1.0.  A strong positive correlation is a positive number that is above, say, 0.3.  For people, there is a positive correlation between height and weight, for example.  A strong negative correlation is a negative number that is less than, say, -0.3.  For gas powered cars, there is a negative correlation between engine displacement and miles per gallon.  Even small correlations may be statistically meaningful if you have enough accurate measurements.  The heat map presents the correlations as a grid, where the positive correlations might be redder and the negative correlations might be bluer.\n\n2. **Pair Plot:** Displays pairwise relationships between multiple variables.\n    One form of the pair plot is the scatter plot.  Each dot on the plot represents one observation.  If there is a good correlation between the paired values, the points may line up.  You can also give a color for each dot, depending on the value of yet another column.  In the case of vehicles, you might have vehicle weight plotted vs. miles per gallon, and then you might have the dots colored by horsepower.  For a given horsepower, the mpg vs. vehicle weight might line up, but then you'd have high horsepower cars that are off of this line in one direction, indicated by a particular color.  One can customise the plot in various ways, such as by showing countour lines instead of individual dots.\n\n### **When to Use:**\n- **Heatmap**: Ideal for visualizing **correlations** or **relationships** in matrix-style data, such as the correlation between different features in a dataset.\n- **Pair Plot**: Great for **multivariate analysis**, where you want to explore relationships between multiple features in a dataset.\n\nFor the example below, you use the Titanic dataset.  This dataset is built into Seaborn, so you can do sns.load_dataset().  In more typical cases, you load CSV files using pandas.  The Titanic dataset has the following columns:\n\n- survived: True or False.\n- pclass: Passenger class, meaning what kind of ticket or accomodation the passenger had.\n- age\n- sibsp: How many siblings or spouses each passenger had on the ship.\n- parch: How many parents or children each passenger had on the ship.\n- fare: How much the passenger's ticket cost.\n- adult_male: True or False.\n- alone: True or False, whether the passenger was traveling alone.\n\n### **Example Code: Creating Advanced Visualizations**\n```python\nimport seaborn as sns\nimport matplotlib.pyplot as plt\n\n# Load Titanic dataset: This dataset is \ntitanic = sns.load_dataset(\"titanic\")\n\n# Heat map of correlations\nplt.figure(figsize=(10, 6))\ncorrelation_matrix = titanic.corr(numeric_only=True)\nsns.heatmap(correlation_matrix, annot=True, cmap=\"coolwarm\", fmt=\".2f\")\nplt.title(\"Correlation Heatmap\")\nplt.show()\n\n# Pair Plot\nsns.pairplot(titanic, vars=[\"age\", \"fare\", \"adult_male\"], hue=\"survived\", palette=\"Set2\")\nplt.title(\"Pair Plot of Age, Fare, and Survival\")\nplt.show()\n```\n\n### **Outcome:**\n- The **Heat Map** visualizes the correlation matrix of the Titanic dataset.\n    Take a look at the heatmap, and assess which factors most important in affecting who survived.  Two factors made survival much less likely: Can you guess why?  One factor made survival more likely: Which one?\n\n- The **Pair Plot** provides pairwise relationships between 'age', 'fare', and 'adult_male', as colored by whether these passengers survived.\n    Some of these plots are not very useful.  Scatter plots where the variable on one of the axes only has two values are typically not very helpful, as you see.  The plots on the diagonal have a single variable plotted against itself, which doesn't seem too useful either, except that the default plot in this case is a \"kde\" plot, which shows the distribution of that single variable, as colored by who survived, and those plots do convey a story.\n\n---\n\n## **10.4 Advanced Customization**\n\n### **Overview**\nAdvanced customization techniques include working with multiple subplots, adjusting figure sizes, and using color palettes to enhance the aesthetics of visualizations.\n\n### **Key Concepts:**\n- **Subplots:** Create multiple plots in one figure.\n- **Color Palettes:** Use predefined or custom color palettes for better aesthetics.\n- **Annotations:** Add text annotations to specific points on the plot.\n\n### **When to Customize Further:**\n- **Subplots**: Useful for comparing multiple visualizations in one figure, especially when you want to show different types of plots.\n- **Color Palettes**: Enhance visual appeal and help in distinguishing between categories.\n- **Annotations**: Add extra context or insights to specific parts of a plot.\n\n### **Example Code: Advanced Customization**\n```python\nimport matplotlib.pyplot as plt\nimport numpy as np\nimport seaborn as sns\n\ncategories = [\"Region A\", \"Region B\"]\nsales = [500, 700]\nrandom_data = np.random.randn(1000)\n\n# Subplot Example\nfig, axes = plt.subplots(1, 2, figsize=(12, 6))\n\n# Left plot: Bar Plot\naxes[0].bar(categories, sales, color=['skyblue', 'salmon'])\naxes[0].set_title(\"Sales by Region\")\naxes[0].set_xlabel(\"Region\")\naxes[0].set_ylabel(\"Sales ($)\")\n\n# Right plot: Histogram\naxes[1].hist(random_data, bins=30, color='purple')\naxes[1].set_title(\"Random Data Distribution\")\naxes[1].set_xlabel(\"Value\")\naxes[1].set_ylabel(\"Frequency\")\n\nplt.tight_layout()  # Adjust layout for better spacing\nplt.show()\n\n# Using a Custom Color Palette in Seaborn\nsns.set_palette(\"muted\")\nsns.barplot(x=categories, y=sales)\nplt.title(\"Sales by Region with Custom Palette\")\nplt.show()\n```\n\n### **Key Techniques:**\n- **Subplots** allow the creation of multiple plots in a single figure for better comparison.\n- Seaborn’s **custom color palette** gives more control over the visual appearance.\n\n---\n\n## **Summary**\n\nIn this lesson, you learned:\n1. How to create basic visualizations (line plots, bar plots, histograms) using Matplotlib.\n2. Techniques for customizing plots to improve readability and presentation.\n3. How to use Seaborn for advanced statistical visualizations like heatmaps and pair plots.\n4. Advanced techniques for creating subplots, using color palettes, and adding annotations for more insightful visualizations.\n\nFor more details, explore the [Matplotlib Documentation](https://matplotlib.org/stable/contents.html), [Seaborn Documentation](https://seaborn.pydata.org/), and the [Python Data Visualization](https://matplotlib.org/stable/gallery/index.html).\n\n---\n\n### Additional Resources:\n1. **Matplotlib Tutorials:** For more detailed Matplotlib tutorials, check out [Matplotlib Tutorials](https://matplotlib.org/stable/tutorials/index.html).\n2. **Seaborn Gallery:** Explore different plot examples at the [Seaborn Gallery](https://seaborn.pydata.org/examples/index.html).\n3. **Data Visualization in Python:** To explore more about data visualization strategies and best practices, visit [Data Visualization in Python](https://realpython.com/python-data-visualization-using-matplotlib/).\n\n",
      "videoUrl": "",
      "codeExamples": [],
      "externalLinks": [],
      "quizzes": [],
      "_id": "68796c79a4ac7ef2a17a6199"
    }
  ]
}